GroggyAlgorithm/HalBuilder/Examples/GeneratedHeaders/avr128db28_32_48_65_Pins.h
/**
* \file avr128db28_32_48_65_Pins
* \author Auto Hal Builder, Tim Robbins
* \date 2023-09-26 12:57:11.429709
* \brief Auto Generated Definitions 
*
*/
#ifndef AVR128DB28_32_48_65_PINS_H_
#define AVR128DB28_32_48_65_PINS_H_ 1



#define PA7_PIN                         A, 7
#define PIN_0                           A, 7

#define PA2_PIN                         A, 2
#define PIN_1                           A, 2

#define PA3_PIN                         A, 3
#define PIN_2                           A, 3

#define PD4_PIN                         D, 4
#define PIN_3                           D, 4

#define PD2_PIN                         D, 2
#define PIN_4                           D, 2

#define PD3_PIN                         D, 3
#define PIN_5                           D, 3

#define PD1_PIN                         D, 1
#define PIN_6                           D, 1

#define PA4_PIN                         A, 4
#define PIN_7                           A, 4

#define PF6_PIN                         F, 6
#define PIN_8                           F, 6
#define RESET_PIN                       F, 6

#define PA1_PIN                         A, 1
#define PIN_9                           A, 1
#define XTALHF2_PIN                     A, 1

#define PF1_PIN                         F, 1
#define PIN_10                          F, 1
#define XTAL32K2_PIN                    F, 1

#define PF0_PIN                         F, 0
#define PIN_11                          F, 0
#define XTAL32K1_PIN                    F, 0

#define PC0_PIN                         C, 0
#define PIN_12                          C, 0

#define PC1_PIN                         C, 1
#define PIN_13                          C, 1

#define PC3_PIN                         C, 3
#define PIN_14                          C, 3

#define PC2_PIN                         C, 2
#define PIN_15                          C, 2

#define PD5_PIN                         D, 5
#define PIN_16                          D, 5

#define PD7_PIN                         D, 7
#define PIN_17                          D, 7

#define PA5_PIN                         A, 5
#define PIN_18                          A, 5

#define PA6_PIN                         A, 6
#define PIN_19                          A, 6

#define PD6_PIN                         D, 6
#define PIN_20                          D, 6



//Adc Definitions


//Pwm Definitions



#endif